content.org/posts/blackhole.org
# -*- mode: org -*-
#+HUGO_BASE_DIR: ../..
#+HUGO_SECTION: posts
#+HUGO_WEIGHT: 2000
#+HUGO_AUTO_SET_LASTMOD: t
#+TITLE: "Blackhole - Recording Sound Output in Macbook"
#+DATE: 2019-11-28T18:10:58-08:00
#+HUGO_TAGS: "sound recording" blackhole mac
#+HUGO_CATEGORIES: sound
#+HUGO_MENU_off: :menu "main" :weight 2000
#+HUGO_CUSTOM_FRONT_MATTER: :foo bar :baz zoo :alpha 1 :beta "two words" :gamma 10 :mathjax true
#+HUGO_DRAFT: false

#+STARTUP: indent hidestars showall
* blackhole installation
https://github.com/ExistentialAudio/BlackHole
* mix output
- command space - midi
- audio midi setup
- click on the plus sign at bottom left
- add a multi-output device
- should contain built in output and add blackhole
- you can adjust the volume (I can't seem to be able to do that)
* setting the input
- there are two options
** all input
- command space - sound
- change the input to default to blackhole
** specific input
- quicktime
- start screen recording
- next to the record button there is a settings button arrow (small)
- set the device to blackhole

