content/posts/blackhole.md
+++
title = "Blackhole - Recording Sound Output in Macbook"
author = ["adam"]
date = 2019-11-28T18:10:58-08:00
lastmod = 2019-11-28T20:03:38-08:00
tags = ["sound recording", "blackhole", "mac"]
categories = ["sound"]
draft = false
weight = 2000
foo = "bar"
baz = "zoo"
alpha = 1
beta = "two words"
gamma = 10
mathjax = true
+++

## blackhole installation {#blackhole-installation}

<https://github.com/ExistentialAudio/BlackHole>


## mix output {#mix-output}

-   command space - midi
-   audio midi setup
-   click on the plus sign at bottom left
-   add a multi-output device
-   should contain built in output and add blackhole
-   you can adjust the volume (I can't seem to be able to do that)


## setting the input {#setting-the-input}

-   there are two options


### all input {#all-input}

-   command space - sound
-   change the input to default to blackhole


### specific input {#specific-input}

-   quicktime
-   start screen recording
-   next to the record button there is a settings button arrow (small)
-   set the device to blackhole
